app/controllers/store_controller.rb

  def add_to_cart
    begin
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 2)

  def remove_from_cart
    begin
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 2)